/*
Выберите условия, необходимые для того, чтобы метод производного класса переопределил метод базового класса.
Это сложный вопрос. Если правильный ответ никак не находится, попробуйте экспериментально проверить все эти условия
на каком-нибудь синтетическом примере. Факт успешного переопределения метода поможет подтвердить аннотация @Override.

Выберите все подходящие ответы из списка:

Метод производного класса должен иметь модификатор доступа, такой же или более открытый, чем метод базового класса.
Метод производного класса должен иметь в точности тот же набор параметров, что и метод базового класса.
Метод производного класса должен иметь в точности тот же тип возвращаемого значения, что и метод базового класса.
Метод производного класса должен иметь в точности тот же модификатор доступа, что и метод базового класса.
Метод базового класса должен быть виден в производном классе.
Метод производного класса должен быть помечен аннотацией @Override.
Тип, возвращаемый методом производного класса, должен совпадать или быть подклассом типа, возвращаемого методом базового класса.
*/
public class ChechingeritationClasses2 {
    public static class Inherit {
        
    }
}
